Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПоставкаИОтправкаТоваров
	Движения.ПоставкаИОтправкаТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьОтправкаВРейс из ТабличнаяЧастьОтправкаВРейс Цикл
		Движение = Движения.ПоставкаИОтправкаТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Товар = ТекСтрокаТабличнаяЧастьОтправкаВРейс.Товар;
		Движение.АдресОТкуда = АдресОтгрузки;
		Движение.АдресКуда = АдресДоставки;
		Движение.Количество = ТекСтрокаТабличнаяЧастьОтправкаВРейс.Количество;
		Движение.Цена = ТекСтрокаТабличнаяЧастьОтправкаВРейс.Количество;
		Движение.Сумма = ТекСтрокаТабличнаяЧастьОтправкаВРейс.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры