Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПоставкаИОтправкаТоваров
	Движения.ПоставкаИОтправкаТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧастьПоставкаТовара из ТабличнаяЧастьПоставкаТовара Цикл
		Движение = Движения.ПоставкаИОтправкаТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Товар = ТекСтрокаТабличнаяЧастьПоставкаТовара.Товар;
		Движение.АдресКуда = АдресВыгрузкиТовара;
		Движение.Количество = ТекСтрокаТабличнаяЧастьПоставкаТовара.Количество;
		Движение.Цена = ТекСтрокаТабличнаяЧастьПоставкаТовара.Цена;
		Движение.Сумма = ТекСтрокаТабличнаяЧастьПоставкаТовара.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры