
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПриемИУвольнениеСотрудников Приход
	Движения.ПриемИУвольнениеСотрудников.Записывать = Истина;
	Движение = Движения.ПриемИУвольнениеСотрудников.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ФИО = ФИО;
	Движение.Должность = Должность;
	Движение.СНИЛС = СНИЛС;
	Движение.ИНН = ИНН;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
